-- MySQL dump 10.13  Distrib 8.0.23, for Win64 (x86_64)
--
-- Host: localhost    Database: happyhouse
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `board`
--

DROP TABLE IF EXISTS `board`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `board` (
  `boardid` int NOT NULL AUTO_INCREMENT,
  `title` varchar(45) NOT NULL,
  `content` varchar(5000) NOT NULL,
  `writedate` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `userid` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`boardid`),
  KEY `board_userid_fk_idx` (`userid`),
  CONSTRAINT `board_userid_fk` FOREIGN KEY (`userid`) REFERENCES `member` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `board`
--

LOCK TABLES `board` WRITE;
/*!40000 ALTER TABLE `board` DISABLE KEYS */;
INSERT INTO `board` VALUES (1,'내가사는그집 새단장 오픈 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(2,'내가사는그집 부동산 작업 안내','ㅎㅎ','2021-05-18 15:00:00','관리자'),(3,'[안내] 내가사는그집 찜 랭킹 서비스 개편 안내(5/19)','ㅎㅎ','2021-05-18 15:00:00','관리자'),(4,'부동산 서비스 작업 안내 (5/19)','ㅎㅎ','2021-05-18 15:00:00','관리자'),(5,'[안내] 맞춤매물 서비스 안내','ㅎㅎ','2021-05-18 15:00:00','관리자'),(6,'[안내] 근처 상권 정보 서비스 안내','ㅎㅎ','2021-05-18 15:00:00','관리자'),(7,'[안내] 서비스이용약관, 안심운영정책(2021/05/19) 개정안내','ㅎㅎ','2021-05-18 15:00:00','관리자'),(8,'내가사는그집 서비스 이용약관(2021/05/20) 개정 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(9,'내가사는그집 서비스 이용약관(2021/05/20) 개정 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(10,'내가사는그집 개인정보처리방침(2021/05/20) 개정안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(11,'내가사는그집 매물데이터 작업 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(12,'내가사는그집 부동산 작업 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(13,'[안내] 내가사는그집 찜 랭킹 서비스 개편 안내(5/20)','ㅎㅎ','2021-05-19 15:00:00','관리자'),(14,'부동산 서비스 작업 안내 (5/20)','ㅎㅎ','2021-05-19 15:00:00','관리자'),(15,'[안내] 맞춤매물 서비스 종료 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(16,'[안내] 근처 상권 정보 서비스 오픈 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(17,'[안내] 스타필드 바로 앞 1,555실 ‘아이엠 삼송’ 입주문의 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(18,'내가사는그집 서비스 이용약관(2021/05/20) 개정 안내','ㅎㅎ','2021-05-19 15:00:00','관리자'),(19,'내가사는그집 서비스 이용약관(2021/05/21) 개정 안내','ㅎㅎ','2021-05-20 15:00:00','관리자'),(20,'내가사는그집 개인정보처리방침(2021/05/21) 개정안내','ㅎㅎ','2021-05-20 15:00:00','관리자'),(21,'내가사는그집 개인정보처리방침(2021/05/21) 개정안내','ㅎㅎ','2021-05-20 15:00:00','관리자'),(22,'내가사는그집 서비스 이용약관(2021/05/22) 개정 안내','ㅎㅎ','2021-05-21 15:00:00','관리자'),(23,'내가사는그집 개인정보처리방침(2021/05/22) 개정안내','ㅎㅎ','2021-05-21 15:00:00','관리자'),(24,'내가사는그집 개인정보처리방침(2021/05/23) 개정안내','ㅎㅎ','2021-05-22 15:00:00','관리자'),(25,'내가사는그집 서비스 이용약관(2021/05/23) 개정 안내','ㅎㅎ','2021-05-22 15:00:00','관리자'),(26,'내가사는그집 개인정보처리방침(2021/05/24) 개정안내','ㅎㅎ','2021-05-23 15:00:00','관리자'),(27,'내가사는그집 개인정보처리방침(2021/05/25) 개정안내','ㅎㅎ','2021-05-24 15:00:00','관리자'),(28,'내가사는그집 서비스 이용약관(2021/05/25) 개정 안내','ㅎㅎ','2021-05-24 15:00:00','관리자'),(29,'[공지] ﻿내가사는그집 서비스 이용약관(2021/05/26) 개정 안내','ㅎㅎ','2021-05-26 04:46:48','관리자'),(30,'[공지] 내가사는그집 개인정보처리방침(2021/05/26) 개정 안내','ㅎㅎ','2021-05-26 04:46:49','관리자'),(31,'[소식] 부동산을 구하는 새로운 자세, 부동산은 내가사는그집부터!','ㅎㅎ','2021-05-26 04:46:51','관리자'),(32,'[이벤트] 내가사는그집 런칭 이벤트! 축하메세지를 보내주세요~!','gg','2021-05-26 04:48:38','관리자'),(35,'[이벤트] 내가사는그집 런칭 이벤트! SNS 홍보하면 선물이 와르르','?내가사는그집이 런칭했습니다!✨\n\n길다면 길고 짧다면 짧았던 그 시간!\n우리의 Happy House가 \'내가 사는 그 집\'으로 최종 정착역에 도착했다..!\n\n네가 사는 그 집~? 그 집이 내 집이었어야 해~?\n내가 살고 있는 이 집은 얼마에 내놔야하지?\n내가 사야 할 그 집은 얼마에 사야할까?\n지금 바로 [ 내가 사는 그 집 ] 에서 매물 정보를 확인하세요!\n\n매물 정보, 가격도 중요하지만 당신이 놓치고 있는 게 있다면..?!\n???웅성???뭐야??????\n웅성???뭔데????뭐지???\n\n우리 집 주변에 밥 집이 있나..? 편의점은 얼마나 있지..? 미용실은 있어..?\n동네 주변 상가는 어떤 게 있는지, 얼마나 있는지 차트를 통해 확인하세요\n이사 왔는데 이게뭐람? 편의점이 없다? 안 되지 안 되지~\n\n\n이렇게나 멋진 내가사는그집✨\n지금 바로 SNS에 \'내가사는그집\' 홈페이지를 홍보해주세요!\n추첨을 통해 관심과 사랑을 드립니다~! ?\n\n---------------------------------\n\n✔ 이벤트 기간 : 2021/05/26 ~ 2021/05/28\n\n✔ 참여 방법 :\n     Step 1. 인스타그램/ 페이스북에 로그인을 한다!\n     Step 2. \'내가사는그집\' 홈페이지 런칭을 축하하는 메세지와 사진을 올린다!\n     Step 2. 필수태그 [ #내가사는그집, #내가사는그집_축하해, #런칭이벤트, #꽃길만걸어 ]\n               를 포함해서 ?공개 게시글?로 올려주세요!\n\n✔ 이벤트 경품 : 개발자들의 사랑과 관심! ?\n\n많이많이 참여해주세요~','2021-05-25 15:00:00','관리자');
/*!40000 ALTER TABLE `board` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-05-27  9:41:46
